
#####

print("Вас вітає експертна система класифікації жанрів комп’ютерних ігор !")
print("Виконав Федоров Максим КНМС-11")
print("\nВибирайте відповіді ввівши номер варіанту\т")

# Перші питання

first_questions = [
"""
Який тип бойовиків вам більше подобається?
1. Аркади й ритм-ігри
2. Перестріляти всіх
3. Платформери й бігання
4. Поєдинки й бойові мистецтва
5. Рубанина
6. Стрілянки від першої особи
7. Стрілянки від третьої особи
""", 7,
"""
Який тип рольових ігор вам більше подобається?
1. Групові ігри
2. Мандрівні ігри
3. Покрокові ігри
4. Пригодницькі рольові ігри
5. Рольові бойовики
6. Стратегічні рольові ігри
7. Масова мережева рольова гра
""", 7,
"""
Який тип стратегій вам більше подобається?
1. Військові стратегії
2. Містобудівельні ігри
3. Стратегії в реальному часі
""", 3,
"""
Який тип пригодницьких ігор вам більше подобається?
1. Глибокий сюжет
2. Головоломки
3. Казуальні ігри
4. Метроїдванії
5. Пригодницькі рольові ігри
6. Приховані об’єкти
""", 6,
"""
Який тип симуляторів вам більше подобається?
1. Будівництво й автоматизація
2. Життя й занурення
3. Космос і літання
4. Пісочниці й фізика
5. Фермерство й виготовлення
""", 5,
"""
Який тип спортивних ігор та перегон вам більше подобається?
1. Індивідуальні види спорту
2. Командний спорт
3. Перегони
4. Полювання і риболовля
""", 4
]

# Другі питання

second_questions = [
    [
"""
1. Кооперативна гра
2. Одиночна гра
""", 2,
"""
1. Складна гра
2. Легка гра
""", 2,
"""
1. Гра головоломка
2. Гра платформер
""", 2,
"""
1. Двовимірний поєдинок
2. Симулятор
""", 2,
"""
1. Піксельна графіка
2. Тривимірна фантастика
""", 2,
"""
1. Реалістична графіка
2. Мультяшний дизайн
""", 2,
"""
1. Ігри про події сучасного світу
2. Ігри про події минулого
""", 2
    ]
]

# Ігри

answers = [
    [
        ["CUPHEAD"]
    ]
]

# Посилання

links = [
    ["https://store.steampowered.com/category/arcade_rhythm/"]
]

#####

res = []

# Головне питання

print(
"""
Який жанр комп'ютерних ігор вам бльше подобається?
1. Бойовики
2. Рольові
3. Стратегії
4. Пригоди
5. Симулятори
"""
)

chk = True
while chk:
    try:
        inp = int(input())
        if not inp in range(1, 7):
            print("Введіть номер варіанту")
        else:
            chk = False
    except ValueError:
        print("Введіть номер варіанту")

res.append(inp)

# Перше питання

print(first_questions[res[0] * 2 - 2])

chk = True
while chk:
    try:
        inp = int(input())
        if not inp in range(1, first_questions[res[0] * 2 - 1] + 1):
            print("Введіть номер варіанту")
        else:
            chk = False
    except ValueError:
        print("Введіть номер варіанту")

res.append(inp)

# Друге питання

print("Виберіть варіант, який вам більше подобається")

print(second_questions[res[0] * 2 - 2][res[1] * 2 - 2])

chk = True
while chk:
    try:
        inp = int(input())
        if not inp in range(1, second_questions[res[0] * 2 - 1][res[1] * 2 - 1] + 1):
            print("Введіть номер варіанту")
        else:
            chk = False
    except ValueError:
        print("Введіть номер варіанту")

res.append(inp)

print("На основі ваших відповідей найкращою грою для вас буде " 
      + answers[res[0] - 1][res[1] - 1][res[2] - 1] + 
      "\nЯкщо вам не сподобалася запропонована гра перейдіть за посиланням "
      + links[res[0] - 1][res[1] - 1])
